; domain
(define (domain minecraft)
  (:requirements :typing)

  (:types
    location                            ; Position in 3D space
    block                               ; Block, that can be manipulated with
  )

  (:predicates
    (at-robot ?l - location)            ; Robot position
    (at-block ?b - block ?l - location) ; Block position
    (on ?top - block ?bottom - block)   ; Top is on the Bottom (Removed comma here)
    (on-ground ?b - block)              ; The block `b` is on the ground
    (free-ground ?l - location)         ; Ground at `l` does not have a block there
    (clear ?b - block)                  ; No block above block `b`
    (handempty)                         ; If robot has free hands
    (holding ?b - block)                ; Robot is holding block `b`
    (adjacent ?l1 ?l2 - location)       ; If two locations are adjacent
  )

  (:action move
    :parameters (?from ?to - location)  ; Move from `from` location to `to` location
    :precondition (and
      (at-robot ?from)                  ; Robot is at starting location `from`
      (adjacent ?from ?to)              ; `from` and `to` are adjacent
    )
    :effect (and
      (not (at-robot ?from))            ; Remove robot from `from`
      (at-robot ?to)                    ; Add robot to `to`
    )
  )

  (:action pick-up-from-ground
   :parameters (
      ?b - block                        ; Block to pick-up
      ?bloc - location                  ; Block location
      ?rloc - location                  ; Robot location
    )
    :precondition(and
      (at-robot ?rloc)                  ; Robot must be at robot location
      (at-block ?b ?bloc)               ; Block to pick-up must be at block location
      (adjacent ?rloc ?bloc)            ; Robot must be next to block to pick-up
      (clear ?b)                        ; Block to pick-up does not have anything above
      (on-ground ?b)                    ; Block to pick-up is on the ground
      (handempty)                       ; Robot must have empty hand to pick-up
    )
    :effect(and
      (not (at-block ?b ?bloc))         ; Block not at the location anymore
      (not (on-ground ?b))
      (not (clear ?b))
      (free-ground ?bloc)
      (not (handempty))                 ; Not empty hand anymore
      (holding ?b)                      ; Block `b` in hand
    )
  )

  (:action pick-up-from-block
   :parameters (
     ?top - block                       ; Block to pick-up (top one)
     ?bottom - block                    ; Block `bottom` the `top` one
     ?bloc - location                   ; Location of the stack
     ?rloc - location                   ; Robot location
   )
   :precondition(and
     (at-robot ?rloc)                   ; Robot must be at robot location
     (at-block ?top ?bloc)              ; `Top` block is where it should be
     (at-block ?bottom ?bloc)           ; `Bottom` block is where it should be
     (on ?top ?bottom)                  ; `Top` is on `bottom` block
     (adjacent ?rloc ?bloc)             ; Robot is next to the stack
     (clear ?top)                       ; Nothing is on `top` block
     (handempty)                        ; Robot must have empty hand to pick-up
   )
   :effect(and
     (not (at-block ?top ?bloc))        ; Fixed ?toploc to ?bloc
     (not (on ?top ?bottom))            ; `Top` is no longer on the `bottom`
     (not (clear ?top))
     (clear ?bottom)                    ; `Bottom` now does not block above
     (not (handempty))                  ; Not empty hand anymore
     (holding ?top)                     ; Fixed ?b to ?top
   )
  )

  (:action put-down-on-ground           ; Put a block on the ground
    :parameters(
      ?b - block                        ; Block to put-down
      ?bloc - location                  ; Where to put it
      ?rloc - location                  ; Robot location
    )
    :precondition(and
      (at-robot ?rloc)                  ; Robot is on the location
      (adjacent ?rloc ?bloc)            ; Robot is next to the location to put-down the block
      (free-ground ?bloc)
      (holding ?b)
    )
    :effect(and
      (at-block ?b ?bloc)
      (on-ground ?b)                    ; Added this back so the block registers as on the ground!
      (clear ?b)                        ; Fixed ?bloc to ?b (blocks are clear, not locations)
      (not (free-ground ?bloc))
      (not (holding ?b))
      (handempty)
    )
  )

  (:action put-down-on-block
   :parameters(
     ?top - block                       ; Block currently in hand
     ?bottom - block                    ; Block to place it on
     ?bloc - location                   ; Location of the target block
     ?rloc - location                   ; Robot location
    )
   :precondition(and
     (at-robot ?rloc)
     (at-block ?bottom ?bloc)           ; Target block is at this location
     (adjacent ?rloc ?bloc)             ; Robot is next to the target block
     (clear ?bottom)                    ; Target block has nothing on it
     (holding ?top)                     ; Robot is holding the top block
    )
   :effect(and
     (not (holding ?top))
     (handempty)
     (at-block ?top ?bloc)              ; The top block is now at this grid location
     (on ?top ?bottom)                  ; The top block is on the bottom block
     (clear ?top)                       ; The top block is now clear
     (not (clear ?bottom))              ; The bottom block is no longer clear
    )
  )
)

; problem
(define (problem minecraft-build)
  (:domain minecraft)

  (:objects
    loc_0_0 loc_0_1 loc_0_2 loc_1_0 loc_1_1 loc_1_2 loc_2_0 loc_2_1 loc_2_2 - location
    b1 b2 b3 - block
  )

  (:init
    (handempty)
    (at-robot loc_0_0)
    (adjacent loc_0_0 loc_1_0)
    (adjacent loc_0_0 loc_0_1)
    (adjacent loc_0_1 loc_1_1)
    (adjacent loc_0_1 loc_0_0)
    (adjacent loc_0_1 loc_0_2)
    (adjacent loc_0_2 loc_1_2)
    (adjacent loc_0_2 loc_0_1)
    (adjacent loc_1_0 loc_0_0)
    (adjacent loc_1_0 loc_2_0)
    (adjacent loc_1_0 loc_1_1)
    (adjacent loc_1_1 loc_0_1)
    (adjacent loc_1_1 loc_2_1)
    (adjacent loc_1_1 loc_1_0)
    (adjacent loc_1_1 loc_1_2)
    (adjacent loc_1_2 loc_0_2)
    (adjacent loc_1_2 loc_2_2)
    (adjacent loc_1_2 loc_1_1)
    (adjacent loc_2_0 loc_1_0)
    (adjacent loc_2_0 loc_2_1)
    (adjacent loc_2_1 loc_1_1)
    (adjacent loc_2_1 loc_2_0)
    (adjacent loc_2_1 loc_2_2)
    (adjacent loc_2_2 loc_1_2)
    (adjacent loc_2_2 loc_2_1)
    (at-block b1 loc_1_2)
    (on-ground b1)
    (clear b1)
    (at-block b2 loc_2_2)
    (on-ground b2)
    (clear b2)
    (at-block b3 loc_1_1)
    (on-ground b3)
    (clear b3)
    (free-ground loc_0_0)
    (free-ground loc_0_1)
    (free-ground loc_0_2)
    (free-ground loc_1_0)
    (free-ground loc_2_0)
    (free-ground loc_2_1)
  )

  (:goal (and
    (at-block b1 loc_2_1)
    (on-ground b1)
    (at-block b2 loc_2_1)
    (on b2 b1)
    (at-block b3 loc_2_1)
    (on b3 b2)
  ))
)

; plan
1. (move loc_0_0 loc_1_0)
   deleted: (at-robot loc_0_0)
   added: (at-robot loc_1_0)
   goals met: 1 of 6
2. (move loc_1_0 loc_1_1)
   deleted: (at-robot loc_1_0)
   added: (at-robot loc_1_1)
   goals met: 1 of 6
3. (move loc_1_1 loc_1_2)
   deleted: (at-robot loc_1_1)
   added: (at-robot loc_1_2)
   goals met: 1 of 6
4. (pick-up-from-ground b2 loc_2_2 loc_1_2)
   deleted: (at-block b2 loc_2_2) (on-ground b2) (clear b2) (handempty)
   added: (free-ground loc_2_2) (holding b2)
   goals met: 1 of 6
5. (put-down-on-ground b2 loc_0_2 loc_1_2)
   deleted: (free-ground loc_0_2) (holding b2)
   added: (at-block b2 loc_0_2) (on-ground b2) (clear b2) (handempty)
   goals met: 1 of 6
6. (pick-up-from-ground b3 loc_1_1 loc_1_2)
   deleted: (at-block b3 loc_1_1) (on-ground b3) (clear b3) (handempty)
   added: (free-ground loc_1_1) (holding b3)
   goals met: 1 of 6
7. (put-down-on-block b3 b2 loc_0_2 loc_1_2)
   deleted: (holding b3) (clear b2)
   added: (handempty) (at-block b3 loc_0_2) (on b3 b2) (clear b3)
   goals met: 2 of 6
8. (move loc_1_2 loc_2_2)
   deleted: (at-robot loc_1_2)
   added: (at-robot loc_2_2)
   goals met: 2 of 6
9. (pick-up-from-ground b1 loc_1_2 loc_2_2)
   deleted: (at-block b1 loc_1_2) (on-ground b1) (clear b1) (handempty)
   added: (free-ground loc_1_2) (holding b1)
   goals met: 1 of 6
10. (put-down-on-ground b1 loc_2_1 loc_2_2)
   deleted: (free-ground loc_2_1) (holding b1)
   added: (at-block b1 loc_2_1) (on-ground b1) (clear b1) (handempty)
   goals met: 3 of 6
11. (move loc_2_2 loc_1_2)
   deleted: (at-robot loc_2_2)
   added: (at-robot loc_1_2)
   goals met: 3 of 6
12. (pick-up-from-block b3 b2 loc_0_2 loc_1_2)
   deleted: (at-block b3 loc_0_2) (on b3 b2) (clear b3) (handempty)
   added: (clear b2) (holding b3)
   goals met: 2 of 6
13. (put-down-on-ground b3 loc_2_2 loc_1_2)
   deleted: (free-ground loc_2_2) (holding b3)
   added: (at-block b3 loc_2_2) (on-ground b3) (clear b3) (handempty)
   goals met: 2 of 6
14. (pick-up-from-ground b2 loc_0_2 loc_1_2)
   deleted: (at-block b2 loc_0_2) (on-ground b2) (clear b2) (handempty)
   added: (free-ground loc_0_2) (holding b2)
   goals met: 2 of 6
15. (move loc_1_2 loc_2_2)
   deleted: (at-robot loc_1_2)
   added: (at-robot loc_2_2)
   goals met: 2 of 6
16. (put-down-on-block b2 b1 loc_2_1 loc_2_2)
   deleted: (holding b2) (clear b1)
   added: (handempty) (at-block b2 loc_2_1) (on b2 b1) (clear b2)
   goals met: 4 of 6
17. (move loc_2_2 loc_1_2)
   deleted: (at-robot loc_2_2)
   added: (at-robot loc_1_2)
   goals met: 4 of 6
18. (pick-up-from-ground b3 loc_2_2 loc_1_2)
   deleted: (at-block b3 loc_2_2) (on-ground b3) (clear b3) (handempty)
   added: (free-ground loc_2_2) (holding b3)
   goals met: 4 of 6
19. (move loc_1_2 loc_2_2)
   deleted: (at-robot loc_1_2)
   added: (at-robot loc_2_2)
   goals met: 4 of 6
20. (put-down-on-block b3 b2 loc_2_1 loc_2_2)
   deleted: (holding b3) (clear b2)
   added: (handempty) (at-block b3 loc_2_1) (on b3 b2) (clear b3)
   goals met: 6 of 6
